# Task 1 На вход программе подается строка. Прочитайте эту строку и отобразите на экране ее первый и последний символ
# (подряд в одну строчку).
#
# a = input()
# print(a[0] + a[-1])


# Task 2 На вход программе подается строка. Прочитайте эту строку и отобразите первые четыре ее символа. Полагается,
# что строка гарантированно имеет длину не менее четырех символов.

a = input()
print(a[0:4])