# Task 1 Объявите в программе следующий список с числами просмотров видео по дням:
# v = [1205, 1101, 1434, 1320, 923, 874]
# Выберите из списка v первые три значения (используя срезы) и выведите этот срез как список на экран.
#
# v = [1205, 1101, 1434, 1320, 923, 874]
# print(v[:3])


# Task 2 Объявите в программе следующий список с числами просмотров видео по дням:
# v = [1205, 1101, 1434, 1320, 923, 874]
# Выберите из него последние четыре значения (используя срезы) и выведите этот срез как список на экран.
#
# v = [1205, 1101, 1434, 1320, 923, 874]
# print(v[-4:])


# Task 3 Объявите в программе следующий список с названиями городов:
# c = ["Москва", "Ульяновск", "Самара", "Тверь", "Вологда", "Омск", "Уфа"]
# С помощью срезов выберите из этого списка города через один (начиная с первого)

c = ["Москва", "Ульяновск", "Самара", "Тверь", "Вологда", "Омск", "Уфа"]
print(c[::2])
