# Task 1 На вход программе подаются две строки (каждая вводится с новой строки). Необходимо их прочитать и объединить
# в одну строку через пробел. Результат вывести на экран.

a, b = input(), input()
print(a, b)