# Task 1  На вход программе подается слово в виде строки. Необходимо прочитать это слово и его первую букву сделать
# заглавной, а остальные - малыми. Результат отобразить на экране.
#
# print(input().title())


# Task 2 На вход программе подается строка. Необходимо прочитать эту строку и определить число вхождений дефисов (-) в
# ней. На экране отобразить полученное число.

print(input().count('-'))