# Math functions and the math module
# Математические функции и модуль math

# Task 1  Допишите текст программы для вычисления модуля введенного с клавиатуры числа
# в переменную d. Выведите результат (модуль) в консоль с помощью функции print.
#
# d = int(input())
# print(abs(d))


# Task 2 Допишите текст программы для нахождения минимального значения из пяти введенных
# целых чисел с выводом результата в консоль (минимального значения) с помощью функции print.
#
# d1, d2, d3, d4, d5 = map(int, input().split())
# print(min(d1, d2, d3, d4, d5))


# Task 3 Допишите текст программы для нахождения максимального значения из пяти введенных
# целых чисел с выводом результата (максимального значения) в консоль с помощью функции print.
#
# d1, d2, d3, d4, d5 = map(int, input().split())
# print(max(d1, d2, d3, d4, d5))