# Variables, assignment operator, type and id functions
# Переменные, оператор присваивания, функции type и id

# Что представляет собой переменная в Python?
# ссылка на объект в памяти
#
# Что делает оператор присваивания (=)?
# создает переменную, если ее ранее не было
# cвязывает переменную с данными
#
# Какая типизация реализована в Python?
# строгая и динамическая типизация
#
# Что происходит при присваивании одной переменной другой (a = b)?
# копирование ссылки и обе переменные ссылаются на один и тот же объект
